src/cf/Reports/УнифицированнаяФорма_МХ20.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Report>
		<Properties>
			<Name>УнифицированнаяФорма_МХ20</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаКонца</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерОтчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоставления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидУчета</Name>
					<Comment>0 - упр.учет, 1 - бух.учет</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЦен</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЦенНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

src/cf/InformationRegisters/ОтветственныеЛица.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>ОтветственныеЛица</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/ЦеныНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>ЦеныНоменклатуры</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПроцентСкидкиНаценки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособРасчетаЦены</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыРасчетаЦены</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТипЦен</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЦенНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/AccountingRegisters/Хозрасчетный.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<AccountingRegister>
		<Properties>
			<Name>Хозрасчетный</Name>
			<ChartOfAccounts>ChartOfAccounts.Хозрасчетный</ChartOfAccounts>
			<Correspondence>true</Correspondence>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Валютный</AccountingFlag>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
					<Balance>false</Balance>
				</Properties>
			</Dimension>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВалютнаяСумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Валютный</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Валютный</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Количественный</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Количественный</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаНУ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.НалоговыйУчет</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаПР</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.НалоговыйУчет</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаВР</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.НалоговыйУчет</AccountingFlag>
					<ExtDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</ExtDimensionAccountingFlag>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСтрокиТабличнойЧасти</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>9</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидТабличнойЧасти</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</AccountingRegister>
</MetaDataObject>

src/cf/Reports/УнифицированнаяФорма_МХ20/Forms/ФормаОтчета/Ext/Form/Module.bsl
&НаКлиенте
Процедура ВыполнитьДействие(Команда)
	Если Команда.Имя="Сформировать" Тогда
		Если Не ЗначениеЗаполнено(Отчет.ДатаНачала) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Необходимо заполнить реквизит <<Дата начала>>!",,"Отчет.ДатаНачала"); Возврат;
		КонецЕсли;
		Если Не ЗначениеЗаполнено(Отчет.ДатаКонца) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Необходимо заполнить реквизит <<Дата конца>>!",,"Отчет.ДатаКонца"); Возврат;
		КонецЕсли;		
		//Если Не ЗначениеЗаполнено(Отчет.Склад) Тогда
		//	ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Необходимо заполнить реквизит <<Склад>>!",,"Отчет.Склад"); Возврат;
		//КонецЕсли;		
		Если Не ЗначениеЗаполнено(Отчет.Организация) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Необходимо заполнить реквизит <<Организация>>!",,"Отчет.Организация"); Возврат;
		КонецЕсли;		
		СформироватьОтчет();
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура СформироватьОтчет()
	Запрос=Новый Запрос;
	Запрос.УстановитьПараметр("Дата", ?(ЗначениеЗаполнено(Отчет.ДатаСоставления), КонецДня(Отчет.ДатаСоставления), ТекущаяДата()));
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница", Отчет.Склад);
	Запрос.Текст="
	|ВЫБРАТЬ
	|	ИсточникДанных.ФизическоеЛицо
	|ИЗ
	|	РегистрСведений.ОтветственныеЛица.СрезПоследних(&Дата, СтруктурнаяЕдиница = &СтруктурнаяЕдиница) КАК ИсточникДанных
	|";
	Выборка=Запрос.Выполнить().Выбрать();

	МОЛСклада=?(Выборка.Следующий(), Выборка.ФизическоеЛицо, "");
	Сведения=КонтактнаяИнформацияСервер.СведенияОЮрФизЛице(Отчет.Организация, ?(ЗначениеЗаполнено(Отчет.ДатаСоставления), Отчет.ДатаСоставления, ТекущаяДата()));	

	СтруктураШапки=Новый Структура();
	СтруктураШапки.Вставить("ДатаНачала"		,Формат(Отчет.ДатаНачала,"ДФ=dd.MM.yyyy"));
	СтруктураШапки.Вставить("ДатаКонца"			,Формат(Отчет.ДатаКонца,"ДФ=dd.MM.yyyy"));
    СтруктураШапки.Вставить("Организация"		,ПечатныеФормыСервер.ОписаниеОрганизации(Сведения, "ПолноеНаименование,ИНН,ФактическийАдрес,Телефоны,НомерСчета,Банк,БИК,КоррСчет"));	
	СтруктураШапки.Вставить("КодПоОКПО"			,Сведения.КодПоОКПО);
	СтруктураШапки.Вставить("Склад"				,Отчет.Склад);
	СтруктураШапки.Вставить("МОЛСклада"			,МОЛСклада);
	СтруктураШапки.Вставить("НомерОтчета"		,Отчет.НомерОтчета);
	СтруктураШапки.Вставить("ДатаСоставления"	,Формат(?(ЗначениеЗаполнено(Отчет.ДатаСоставления), Отчет.ДатаСоставления,ТекущаяДата()),"ДФ=dd.MM.yyyy"));
	СтруктураШапки.Вставить("ПредставлениеНачалаПериода","Остаток на" + Символы.ПС + Формат(Отчет.ДатаНачала,"ДФ=dd.MM.yyyy"));
	СтруктураШапки.Вставить("ПредставлениеПрихода"		,"Приход за" + Символы.ПС + ПредставлениеПериода(Отчет.ДатаНачала, КонецДня(Отчет.ДатаКонца),"ФП=ИСТИНА"));
	СтруктураШапки.Вставить("ПредставлениеРасхода"		,"Расход за" + Символы.ПС + ПредставлениеПериода(Отчет.ДатаНачала, КонецДня(Отчет.ДатаКонца),"ФП=ИСТИНА"));
	СтруктураШапки.Вставить("ПредставлениеКонцаПериода"	,"Остаток на" + Символы.ПС + Формат(Отчет.ДатаКонца,"ДФ=dd.MM.yyyy"));

	// выводим в результат
	ТабличныйДокумент.Очистить();
	Макет=Отчеты.УнифицированнаяФорма_МХ20.ПолучитьМакет("Макет");
		
	// шапка
	ОбластьДляВывода=Макет.ПолучитьОбласть("Шапка");
	ОбластьДляВывода.Параметры.Заполнить(СтруктураШапки);
	ТабличныйДокумент.Вывести(ОбластьДляВывода);

	// многострочная часть
	ОбластьДляВывода=Макет.ПолучитьОбласть("Строка");

	Выборка=ПолучитьВыборкуДанных(Отчет.Организация, Отчет.Склад, Отчет.ТипЦен);
	Пока Выборка.Следующий() Цикл
		Номер=0;
		ВыборкаДетали=Выборка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаДетали.Следующий() Цикл
			Номер=Номер+1;
			ОбластьДляВывода.Параметры.Заполнить(ВыборкаДетали);
			ОбластьДляВывода.Параметры.Номер=Номер;
			ТабличныйДокумент.Вывести(ОбластьДляВывода);		
		КонецЦикла;
	КонецЦикла;
	
	// итоги
	Если НЕ Выборка=Неопределено Тогда
		Выборка.Сбросить();
		Выборка.Следующий();
	КонецЕсли;
	ОбластьДляВывода=Макет.ПолучитьОбласть("Итоги");
	Если НЕ Выборка=Неопределено Тогда
		ОбластьДляВывода.Параметры.Заполнить(Выборка);
	КонецЕсли;
	ТабличныйДокумент.Вывести(ОбластьДляВывода);
КонецПроцедуры

&НаСервере
Функция ПолучитьВыборкуДанных(Организация, Склад, ТипЦен)
	Запрос=Новый Запрос;
	Запрос.УстановитьПараметр("ДатаНачала"	, Отчет.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаКонца"	, КонецДня(Отчет.ДатаКонца));
	Запрос.УстановитьПараметр("Склад"		, Склад);
	Запрос.УстановитьПараметр("Организация"	, Организация);
	Запрос.УстановитьПараметр("ТипЦен"		, ТипЦен);
	Запрос.УстановитьПараметр("Счет"		, ПланыСчетов.Хозрасчетный.ТоварыНаСкладах);

	стрУсловие="Организация=&Организация";
	Если ЗначениеЗаполнено(Склад) Тогда
		стрУсловие=стрУсловие+" И "+?(Отчет.ВидУчета=0, "Склад", "Субконто2")+"=&Склад";
	КонецЕсли;
	
	Если Отчет.ВидУчета=0 Тогда
		Запрос.Текст="
		|ВЫБРАТЬ
		|	ИсточникДанных.Номенклатура КАК Номенклатура,
		|	ИсточникДанных.Номенклатура.Артикул КАК Код,
		|	ИсточникДанных.Номенклатура.БазоваяЕдиницаИзмерения.Наименование КАК ЕдиницаИзмерения,
		|	ИсточникДанных.Номенклатура.БазоваяЕдиницаИзмерения.МеждународноеСокращение КАК ЕдиницаИзмеренияКод,
		|	Цены.Цена КАК Цена,
		|	ИсточникДанных.КоличествоНачальныйОстаток КАК КоличествоНаНачало,
		|	ИсточникДанных.КоличествоКонечныйОстаток КАК КоличествоНаКонец,
		|	ИсточникДанных.КоличествоПриход КАК КоличествоПриход,
		|	ИсточникДанных.КоличествоРасход КАК КоличествоРасход,
		|	ИсточникДанных.СтоимостьНачальныйОстаток КАК СуммаНаНачало,
		|	ИсточникДанных.СтоимостьКонечныйОстаток КАК СуммаНаКонец,
		|	ИсточникДанных.СтоимостьПриход КАК СуммаПриход,
		|	ИсточникДанных.СтоимостьРасход КАК СуммаРасход
		|ИЗ
		|	РегистрНакопления.ПартииТоваровНаСкладах.ОстаткиИОбороты(&ДатаНачала, &ДатаКонца, Период,,"+стрУсловие+") КАК ИсточникДанных
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&ДатаКонца, ТипЦен = &ТипЦен) КАК Цены
		|		ПО ИсточникДанных.Номенклатура = Цены.Номенклатура
		|		И ИсточникДанных.ХарактеристикаНоменклатуры = Цены.ХарактеристикаНоменклатуры
		|ИТОГИ
		|	МАКСИМУМ(Код),
		|	МАКСИМУМ(ЕдиницаИзмерения),
		|	МАКСИМУМ(ЕдиницаИзмеренияКод),
		|	МАКСИМУМ(Цена),
		|	СУММА(КоличествоНаНачало),
		|	СУММА(КоличествоНаКонец),
		|	СУММА(КоличествоПриход),
		|	СУММА(КоличествоРасход),
		|	СУММА(СуммаНаНачало),
		|	СУММА(СуммаНаКонец),
		|	СУММА(СуммаПриход),
		|	СУММА(СуммаРасход)
		|ПО
		|	ОБЩИЕ,
		|	Номенклатура
		|";
	Иначе
		Запрос.Текст="
		|ВЫБРАТЬ
		|	ИсточникДанных.Субконто1 КАК Номенклатура,
		|	ИсточникДанных.Субконто1.Артикул КАК Код,
		|	ИсточникДанных.Субконто1.БазоваяЕдиницаИзмерения.Наименование КАК ЕдиницаИзмерения,
		|	ИсточникДанных.Субконто1.БазоваяЕдиницаИзмерения.МеждународноеСокращение КАК ЕдиницаИзмеренияКод,
		|	Цены.Цена КАК Цена,		
		|	ИсточникДанных.КоличествоНачальныйОстатокДт КАК КоличествоНаНачало,
		|	ИсточникДанных.КоличествоКонечныйОстатокДт КАК КоличествоНаКонец,
		|	ИсточникДанных.КоличествоОборотДт КАК КоличествоПриход,
		|	ИсточникДанных.КоличествоОборотКт КАК КоличествоРасход,
		|	ИсточникДанных.СуммаНачальныйОстатокДт КАК СуммаНаНачало,
		|	ИсточникДанных.СуммаКонечныйОстатокДт КАК СуммаНаКонец,
		|	ИсточникДанных.СуммаОборотДт КАК СуммаПриход,
		|	ИсточникДанных.СуммаОборотКт КАК СуммаРасход
		|ИЗ
		|	РегистрБухгалтерии.Хозрасчетный.ОстаткиИОбороты(&ДатаНачала, &ДатаКонца, Период,,Счет В ИЕРАРХИИ (&Счет),,"+стрУсловие+") КАК ИсточникДанных
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&ДатаКонца, ТипЦен = &ТипЦен) КАК Цены
		|		ПО ИсточникДанных.Субконто1 = Цены.Номенклатура
		|ИТОГИ
		|	МАКСИМУМ(Код),
		|	МАКСИМУМ(ЕдиницаИзмерения),
		|	МАКСИМУМ(ЕдиницаИзмеренияКод),
		|	МАКСИМУМ(Цена),
		|	СУММА(КоличествоНаНачало),
		|	СУММА(КоличествоНаКонец),
		|	СУММА(КоличествоПриход),
		|	СУММА(КоличествоРасход),
		|	СУММА(СуммаНаНачало),
		|	СУММА(СуммаНаКонец),
		|	СУММА(СуммаПриход),
		|	СУММА(СуммаРасход)
		|ПО
		|	ОБЩИЕ,
		|	Номенклатура
		|";
	КонецЕсли;
	
	Возврат Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);	
КонецФункции

&НаСервере
Функция ЗначениеЭлементаОтбора(стрПоле)
	Для Каждого СтрокаКоллекции Из Отчет.КомпоновщикНастроек.Настройки.Отбор.Элементы Цикл
		Если СтрокаКоллекции.ЛевоеЗначение=Новый ПолеКомпоновкиДанных(стрПоле) Тогда
			Возврат ?(СтрокаКоллекции.Использование, СтрокаКоллекции.ПравоеЗначение, Неопределено);
		КонецЕсли;	
	КонецЦикла;
	Возврат Неопределено;
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// Обработчики событий формы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Отчет.Организация=УправлениеПользователямиСервер.ПолучитьЗначениеПоУмолчанию("ОсновнаяОрганизация");
	Отчет.Склад=УправлениеПользователямиСервер.ПолучитьЗначениеПоУмолчанию("ОсновнойСклад");
	Отчет.ТипЦен=УправлениеПользователямиСервер.ПолучитьЗначениеПоУмолчанию("ОсновнойТипЦенПродажи");		
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если Не ЗначениеЗаполнено(Отчет.ДатаНачала) Тогда
		Отчет.ДатаНачала=НачалоГода(ТекущаяДата());
	КонецЕсли;	
	Если Не ЗначениеЗаполнено(Отчет.ДатаКонца) Тогда
		Отчет.ДатаКонца=ТекущаяДата();
	КонецЕсли;
	Если Не ЗначениеЗаполнено(Отчет.ДатаСоставления) Тогда
		Отчет.ДатаСоставления=ТекущаяДата();
	КонецЕсли;
КонецПроцедуры
